#!/usr/bin/env python3
# Author: Yingqin He

import json
import os

product_list = {
    '家用电器': {
        '电视机': {
            '曲面电视': {'三星': 6999, '夏普': 7999},
            '超薄电视': {'索尼': 4999, 'LG': 5299}
        },
        '洗衣机': {
            '滚筒洗衣机': {'西门子': 2280, '美的': 3299},
            '波轮洗衣机': {'海尔': 1699, '小天鹅': 1499}
        }
    },
    '数码产品': {
        '电脑': {
            '笔记本': {'ThinkPad': 5999, '戴尔': 4999},
            '台式机': {'联想': 3999, '惠普': 4999}
        },
        '手机': {
            'IOS': {'iphone 7': 4999, 'iphone 7s': 6199},
            'Android': {'三星': 5688, '小米': 2499}
        }
    },
    '运动户外': {
        '健身器材': {
            '哑铃': {'凯速': 189, '菲尔顿': 218},
            '跑步机': {'锐步': 3380, '舒华': 2999}
        },
        '体育用品': {
            '足球': {'耐克': 199, '阿迪达斯': 219},
            '篮球': {'斯伯丁': 259}
        }
    }
}


if not os.path.exists('product_list.json'):
    with open('product_list.json', 'w') as f:
        json.dump(product_list, f)